In [3]:
import pandas as pd
df = pd.read_csv("/mnt/762af900-5e3c-4ea0-aae0-092233720e98/Downloads/practice_data/Mall_Customers.csv")
df

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [5]:
df.mean()

CustomerID                100.50
Age                        38.85
Annual Income (k$)         60.56
Spending Score (1-100)     50.20
dtype: float64

In [7]:
df.median()

CustomerID                100.5
Age                        36.0
Annual Income (k$)         61.5
Spending Score (1-100)     50.0
dtype: float64

In [4]:
import statistics as st
st.mode(df["Genre"])
# mode shows most occuring element in given column

'Female'

In [5]:
import numpy as n
# find mean of age column
n.mean(df["Age"])

38.85

In [6]:
# find median of age column
n.median(df["Age"])

36.0